todolists/app/controllers/todo_items_controller.rb

  def index
    #@number_of_completed_todos = TodoItem.count_items
    @number_of_completed_todos = TodoItem.all.count_items_todo_list
    @todo_items = TodoItem.all
---
SELECT COUNT(*) FROM "todo_items" WHERE "todo_items"."completed" = ?  [["completed", "t"]]
SELECT "todo_items".* FROM "todo_items"

  def create
    @todo_item = TodoItem.new(todo_item_params)

    respond_to do |format|
      if @todo_item.save
---
INSERT INTO "todo_items" ("title", "description", "due_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "aaaaaaaaaa"], ["description", "aaaaaa"], ["due_date", "2016-04-03"], ["created_at", "2016-04-03 14:30:28.809968"], ["updated_at", "2016-04-03 14:30:28.809968"]]

  def destroy
    @todo_item.destroy
---
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 4]]

    def set_todo_item
      @todo_item = TodoItem.find(params[:id])
---
SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."id" = ? LIMIT 1  [["id", 4]]